farkaToure/embedded/pic18EEPROM/platform.h
#ifdef F46K20

#include "p18f46k20.h"


//PIC18F46K20
#pragma config FOSC = INTIO7, FCMEN = OFF, IESO = OFF                       // CONFIG1H
#pragma config PWRT = OFF, BOREN = OFF, BORV = 30                        // CONFIG2L
#pragma config WDTEN = OFF, WDTPS = 32768                                    // CONFIG2H
#pragma config MCLRE = ON, LPT1OSC = OFF, PBADEN = OFF, CCP2MX = PORTC       // CONFIG3H
#pragma config STVREN = ON, LVP = OFF, XINST = OFF				// CONFIG4L
#pragma config CP0 = OFF, CP1 = OFF, CP2 = OFF, CP3 = OFF                   // CONFIG5L
#pragma config CPB = OFF, CPD = OFF                                         // CONFIG5H
#pragma config WRT0 = OFF, WRT1 = OFF, WRT2 = OFF, WRT3 = OFF                // CONFIG6L
#pragma config WRTB = OFF, WRTC = OFF, WRTD = OFF                            // CONFIG6H
#pragma config EBTR0 = OFF, EBTR1 = OFF, EBTR2 = OFF, EBTR3 = OFF           // CONFIG7L
#pragma config EBTRB = OFF

#endif

void initializeOscillator()
{
    // fuse = INTOSCIO67 => INTOSCIO
#ifdef OSC1MHZ
    OSCCON = 0b10111110; //page29 datasheet
#endif

#ifdef OSC4MHZ
    OSCCON = 0b11011010 ; //page29 datasheet
#define BAUD_9600 25
#endif
#ifdef OSC8MHZ
    OSCCON = 0b11100110; //page29 datasheet
#define BAUD_9600 51
#endif
#ifdef OSC16MHZ
    OSCCON = 0b11111010 ; //page29 datasheet
#endif



    OSCTUNE = 0b10000000; //HFINTOSC & -PLL & FACTORY CALIBRATION
}


